package com.scut.fundialect.help

object GetRandomName {
    val nameStrLong = "莘弘盛鲁高畅郑凡巧周雪容狂香薇虢馨兰郗鸿卓过恺乐蔺忆彤贺阳舒谯美如秘思山种德曜操雪曼傅雅" +
            "柔府兴为李淑哲刘亦云董采春承尔安蒉嘉悦青怀芹六昊英於明俊郯念双杞星爵荆思敏吉春荷封芳林" +
            "权婉丽召涵涵香斯雅闾" +
            "恨荷堂丁辰少乐容蚁忆枫裔凡白桐佩杉汉春梅邱采蓝姜景逸后辰宇招欣悦童世韵折曼妮稽方方庹凯捷宏雍恬张盼" +
            "晴俎丹红艾尔蝶褒冰绿佟智阳彭永逸终忻慕柴阳波仪旭尧溥绮烟行永望厉阳泽骆秋巧燕谷槐营欣畅冼问蕊称雪漫浑和昶" +
            "运俊杰孛天青暴成龙泥骞骞卿欣跃励从雪隐怜容闫谷菱宓丰茂阳诗柳白怀芹孟寻芳赖英睿怀清懿买凌青问勇军凭绿蕊皋" +
            "觅晴冠田然蓟嫣然隆音韵左德辉方千风红慧语由若云官鹏云兴鸿轩衡晶滢阿清卓曹寒凝建鸿骞钮又亦祈盼夏冷怜云乜淑" +
            "华廖朝雨之如雪位言文道白秋抗浩歌扶智宸杭琪华嘉轩昂阎梓敏仁秀曼薄骏哲斯善思姓恺歌羿兴朝蓬坚壁乘淑君旷怜双" +
            "祖元瑶桓蕴和竹子美闭千凡门白秋逢慧晨浦会欣邰夏山律新柔休心远眭一嘉薛博简奕嘉歆钟梦兰蛮紫桐何雁兰储良吉谏" +
            "怀山宜景浩别觅丹梁念蕾毓寻凝琦迎荷穰丹雪郎寻巧斐寄风禾雨竹肇翠梅贯又青仙白竹滕寒雁锐巧" +
            "曼夏甘雨纪振荣江云岚" +
            "劳若云矫怀薇达沛文苟承安佛心语闪从筠崔天元歧书萱计和悌洋芮雅国以旋利清逸局娅玟弓涵育康琇" +
            "莹祁立轩藤怀曼乾亦巧万" +
            "谷秋古湉湉刀志新线青文钭友灵才曼容脱代双娄红豆忻初阳睢半梅刚南霜帅星驰性翠芙叶寄瑶肥雅安" +
            "谌代柔寿海融贰诗霜印志义" +
            "丰波峻田从丹果书慧却阳朔御幼枫夙采珊简湛雨剑嘉致庄文思练博雅霍夏蓉礼慧艳将寄南员凡雁文思聪" +
            "霜怀绿司谷翠樊夜蓉皮海雪" +
            "圭清婉税秋春栗靖柔甄香露生涵阳翁璞瑜铎静婉元浩漫咸静晨止娟妍庚春枫单娟丽硕安安宫冰双羊弘深庆香薇委访文战" +
            "友容势正初盛宛白隗名姝杨雨梅郜弘大牧乐人鄂夏旋朴玲珑伦代巧闵浩丽戏娜兰野涵菱通凝雨熊书双郸沛凝叔宜春仍阳" +
            "飇释高朗旗浩气英紫南蒯文华栾绿蝶仰嘉怡寸灵慧殳佩兰翟叶农清书蝶绍蕴涵荀念真余冰蝶玉娅芳夔宛亦强康德勤语" +
            "林笪雅洁邸巧蕊诸惜萍戈代芙校烨霖鲜秋白象合乐居晓灵羽紫薇尉秋珊慕安珊詹忆然柔彭湃斛和" +
            "美郁弘方段雅琴机依白栋沛岚耿望雅代初阳乔昂然嬴碧蓉友昊伟改傲冬焦智敏彤源源靳心菱盖冉冉芮娟秀郁彦珺顾芳" +
            "茵蒙德水谈灵寒冉傲旋朋雨南满奇思雍海之百俊英督高寒危瑶瑾卯亦" +
            "巧楚巍昂尾芷若袭流丽仉雁梅鄢千凝濯元柳闳雅可是颖秀丛运华回子爱首冬梅公恬美犁蓉城边才俊析新荣衷秀媚冯玛丽" +
            "旅惜寒孔寄翠陶沛容豆怡宁多晓凡祢芳洁戢夏波寻琛瑞闻诗丹鄞翰池支晓曼厚听安户思菱函幻翠摩彤蕊雀舒兰定春姝" +
            "隽俊贤星霞文开安卉睦凌霜昂秀洁班琼诗綦蓉蓉金高原宿朝旭绳语海伊问丝衅若华答元武甫元菱老艳芳奉浩丽沈兰梦广峻" +
            "熙晏恨真查蕙若那远悦管凝丹牟依秋绪冰蓝王锐锋历依瑶出芸若甲新之莱修文姬梦凡寒凝安烟璇玑尤迎秋掌幼仪以正德胥" +
            "初蝶亓曼梅针秀慧泰刚捷龙凌青韦北嘉涂春桃布惜香卑欣悦化贝晨不昌黎宋静珊毋含之典依萱鲍子骞尹作人仝书白连" +
            "博达勇晨风藏鸿畅冒文昂辜秀娟修华月捷升荣禚醉山腾宜民渠飞翰保平良林天恩匡代芙但代容年半双凌霞月汗问萍" +
            "牢春绿检谷兰秦春娇柏涵衍愈曼珍贸荷紫愚香萱源念梦伟昆卉千秀媚姒启颜森采柳惠骊娟巧布侬银嘉禧侨问芙党芬馥粟冰" +
            "之齐驰逸景燕婉实寄柔汪向露舒梓柔麻听莲夫心慈禽夏青奇巧凡时逸明延清润让凡白菅念雁邢友安韩嘉谊琴谷之解之槐" +
            "梅辰良天白梅喜海桃潮玉珂合易梦岑恨寒茹桂帆丹安晏端友桃赛勇毅环曼安幸星文赵诗兰喻忻乐苍睿文竺如蓉堵敏丽北" +
            "婷然廉冬莲仇熙星宗映冬留翠曼牛同方剧叶丹夕初南缑馨香敖安然卫梓玥裘孤菱钊绿凝衣晴画坚骞尧丁令燕侯慧丽宁长" +
            "霞节半梅市鹏赋罗丹萱甘文石载湘云沙霞英郏珍丽云诗蕊巫高丽靖昌勋庞清舒南优乐邵夏山度雁卉庾沙雨越微婉屈雅琴訾" +
            "睿思淡玉华亢向雪舜秀华扬赫然锁可嘉师奇迈邹思懿桥吉欣骑静涵任慧俊茆代灵鱼骊洁韶夏菡松元良宦冰菱赫俊德念海白" +
            "伯鹏飞曲琴雪陆运鸿罕望舒斋痴梅泣夏月九锦诗世恨竹悉山晴许念双拱麦冬壬以晴铁婉娜暨古兰唐萧曼冀漾漾望欣欣中景" +
            "天桑平彤酆谷翠随鸿祯前康健诗文柏蓝婀娜璩芳泽况代巧尚曼冬蒲宵月戎樱花奈飞薇展夏烟京飞羽隋宏毅茂高峻瓮思天" +
            "士易文良晓兰板康胜第晓莉圣银柳碧文惠从语燕揭芷珊颜真一枝清绮帖华采芒秀曼可水蓉次暄妍汤心诺盈芸欣嵇以冬成" +
            "茂彦希永昌依代秋同觅柔能安歌佼信瑞邗清奇臧孤云谭希蓉卓梦桃鞠骊媛僪泽宇浮元英逄暄美拜霞飞禄叶彤覃向雁树雅" +
            "歌阮星泽于成双春迎梅雷修筠桂惜寒潘兴生费春雪严迎梅孙访文悟曼岚城莹然温雁荷蹇子真有醉蝶葛金鑫紫刚毅后兰芳" +
            "姚永怡犹如风沐秀妮屠飞英山绮艳错孤容曾舒云夷千秋粘初珍农明轩厍水风苏良弼遇欣艳哈一凡力丰羽令靖易言碧巧贵" +
            "永嘉池清俊似松月双梦露赤又柔凤锐达纵竹萱邝晴霞谬晗昱墨曜文陈宏盛撒凝旋贝飞瑶锺青文乙清秋玄韶美呼乐家东和" +
            "颂真若星容代芹麴鸿光蔡哲瀚聂迎蕾毛正真辛冰蓝习阳曜慈白容糜书雁花问芙黎山芙迟代天赏幼柏魏傲松籍斯伯昝小霜" +
            "苑懿轩用骊婷理梦容逯浩淼么睿慈功沛珊来康盛候妍丽袁博远资昊苍声星津告元蝶弘正奇宰云臻宝骊颖明成弘蒿音悦库" +
            "文成干鸿云须乐山在清芬雪乐心爱曼丽欧雁菡蒋乐双史依柔殷香巧植思若麦妙芙石晗玥台静娴巨碧菡澄子萱续贝丽业修" +
            "谨五涵亮井耘豪程访冬己映波塞依霜岳诗双贲俊郎徭盼晴应涵瑶步辰锟束从冬丘舒方邬晓燕符子舒智良才路曼婉乌智宇" +
            "酒佳思吾思迪信平卉荤夏柳威惜雪苦高峰弥晗晗侍寻菱其寻梅善梦之藩秋彤虎平安塔令梓章森莉阚云淡占和暖海朝旭素" +
            "半青车芳菲昌婉静吕乐游顿一瑾柳翰音慎慕梅哀柔淑肖古韵莫淑兰宾灵卉都新立丙志尚易奥雅抄映天禹君雅檀慧丽妫姣" +
            "姣宛奇志箕夜南驹羡丽楼半芹黄灵萱汝幻巧仵澄邈荣笑妍益半烟瞿巧香蹉文心诺绮丽潭康伯笃虹英乐田田缪问香受思慧" +
            "勾痴凝卷白萱苗半青项洁玉泷歌阑德海亦郝水瑶恭元龙萧光辉游鸿博频德宇零昂然考鸿志沃含玉务芳懿崇冰夏寇君浩接" +
            "正平洪清晖朱荷珠独鸿振普子平系依薇偶曼青龚晓霜狄骏英繁曼岚空清晖兆敏达尔听云阴婷秀滑兰娜恽欣跃本驰丽字婉" +
            "君邶嘉澍巢嘉祯苌欣德仆向松枚晗日佘尔云蔚雁露集卿云允沙羽融瑜然谷梅英宇元凯原博实祝季同刑天赋辉秀艳法映" +
            "雪翠英逸向长卿闽映菱完元容僧诗文飞怜烟焉子昂大怡乐纳幻巧晁宏放谢白风镇正平进访风敬谷枫卞若南敏幼白漆听荷" +
            "钱英发光天蓝申秀艳茅燕桦扈雪珊泉雪晴徐曼冬奚初南平文滨皇睿才充语海永和煦磨昊焱佴兴平宣弘雅登听春汲睿彤戚" +
            "流丽帛和泽逮淑懿书问梅所柳思翦雨安戊桂华归夜梦窦琲瓃弭雪晴经静和始蕴涵杜兰英瑞昊穹竭书文波问兰陀若芳孝鸿雪" +
            "伏睿博表翠霜旁君昊疏梦菲房凌寒示梦寒常素洁邛欣可褚梦云季浩博謇清逸及清宁安玉轩穆湛蓝饶云水索芳洲学凝丝类" +
            "映阳富哲丽全以柳倪梦旋卜文栋湛舒扬裴诗柳郦皓洁巩芷琪尧雯丽义晓畅区紫萱水芸溪仲雅洁丑靖荷"
    lateinit var array :Array<String>
    var inited =false
    fun getrandomName():String{
        if(inited==false){
            init()
        }
        return array[(0..(array.size-1)).random()]
    }

    private fun init() {
        var long = nameStrLong.length/3
        array =Array<String>(long,){""}
        var pointer =0
        for(item in array){
            array[pointer] = nameStrLong.substring(pointer,pointer+3)
            pointer+=1
        }
        inited=false


    }
}