package com.scut.fundialect.help

object GetRandomSentence {
    val SentenseStrLong = "一般来说， 经过上述讨论， 孔子曾经说过，知之者不如好之者，好之者不如乐之者。\n" +
            "我希望诸位也能好好地体会这句话. 了解清楚华南理工大学天下第一到底是一种怎么样的存在，是解决一切问题的关键。\n" +
            " 从这个角度来看， 对我个人而言，华南理工大学天下第一不仅仅是一个重大的事件，还可能会改变我的人生。\n" +
            " 在这种困难的抉择下，本人思来想去，寝食难安。\n" +
            " 一般来说， 对我个人而言，华南理工大学天下第一不仅仅是一个重大的事件，还可能会改变我的人生。\n" +
            "　　生活中，若华南理工大学天下第一出现了，我们就不得不考虑它出现了的事实。\n" +
            " 我认为， 华南理工大学天下第一，到底应该如何实现。\n" +
            " 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。\n" +
            " 在这种困难的抉择下，本人思来想去，寝食难安。\n" +
            " 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 生活中，若华南理工大学天下第一出现了，我们就不得不考虑它出现了的事实。\n" +
            " 问题的关键究竟为何？ 在这种困难的抉择下，本人思来想去，寝食难安。\n" +
            " 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。\n" +
            "　　邓拓说过一句著名的话，越是没有本领的就越加自命不凡。\n" +
            "我希望诸位也能好好地体会这句话. 我们不得不面对一个非常尴尬的事实，那就是， 既然如此， 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 池田大作在不经意间这样说过，不要回避苦恼和困难，挺起身来向它挑战，进而克服它。\n" +
            "这启发了我. 我们都知道，只要有意义，那么就必须慎重考虑。\n" +
            " 马克思曾经说过，一切节省，归根到底都归结为时间的节省。\n" +
            "这不禁令我深思. 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 总结的来说， 就我个人来说，华南理工大学天下第一对我的意义，不能不说非常重大。\n" +
            " 华南理工大学天下第一的发生，到底需要如何做到，不华南理工大学天下第一的发生，又会如何产生。\n" +
            " 而这些并不是完全重要，更加重要的问题是， 伏尔泰在不经意间这样说过，坚持意志伟大的事业需要始终不渝的精神。\n" +
            "带着这句话, 我们还要更加慎重的审视这个问题: 俾斯麦在不经意间这样说过，失败是坚忍的最后考验。\n" +
            "带着这句话, 我们还要更加慎重的审视这个问题: 总结的来说， 华南理工大学天下第一的发生，到底需要如何做到，不华南理工大学天下第一的发生，又会如何产生。\n" +
            " 克劳斯·莫瑟爵士说过一句富有哲理的话，教育需要花费钱，而无知也是一样。\n" +
            "这似乎解答了我的疑惑. 卡莱尔曾经说过，过去一切时代的精华尽在书中。\n" +
            "带着这句话, 我们还要更加慎重的审视这个问题: 吉格·金克拉曾经说过，如果你能做梦，你就能实现它。\n" +
            "这句话看似简单，但其中的阴郁不禁让人深思. 既然如此， 我认为， 而这些并不是完全重要，更加重要的问题是， 塞涅卡曾经说过，生命如同寓言，其价值不在与长短，而在与内容。\n" +
            "这似乎解答了我的疑惑. 就我个人来说，华南理工大学天下第一对我的意义，不能不说非常重大。\n" +
            " 我认为， 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 对我个人而言，华南理工大学天下第一不仅仅是一个重大的事件，还可能会改变我的人生。\n" +
            " 在这种困难的抉择下，本人思来想去，寝食难安。\n" +
            " 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 经过上述讨论， 那么， 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。\n" +
            "　　这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。\n" +
            " 这样看来， 莫扎特曾经说过，谁和我一样用功，谁就会和我一样成功。\n" +
            "这不禁令我深思. 可是，即使是这样，华南理工大学天下第一的出现仍然代表了一定的意义。\n" +
            " 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 我们都知道，只要有意义，那么就必须慎重考虑。\n" +
            "　　从这个角度来看， 一般来说， 我认为， 奥斯特洛夫斯基说过一句著名的话，共同的事业，共同的斗争，可以使人们产生忍受一切的力量。\n" +
            "　这似乎解答了我的疑惑. 经过上述讨论， 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。\n" +
            " 这样看来， 维龙曾经提到过，要成功不需要什么特别的才能，只要把你能做的小事做得好就行了。\n" +
            "这句话把我们带到了一个新的维度去思考这个问题: 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 在这种困难的抉择下，本人思来想去，寝食难安。\n" +
            " 总结的来说， 歌德说过一句著名的话，意志坚强的人能把世界放在手中像泥块一样任意揉捏。\n" +
            "这启发了我. 既然如何， 既然如何， 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。\n" +
            " 克劳斯·莫瑟爵士在不经意间这样说过，教育需要花费钱，而无知也是一样。\n" +
            "这不禁令我深思. 要想清楚，华南理工大学天下第一，到底是一种怎么样的存在。\n" +
            " 对我个人而言，华南理工大学天下第一不仅仅是一个重大的事件，还可能会改变我的人生。\n" +
            " 可是，即使是这样，华南理工大学天下第一的出现仍然代表了一定的意义。\n" +
            " 一般来讲，我们都必须务必慎重的考虑考虑。\n" +
            " 老子在不经意间这样说过，知人者智，自知者明。\n" +
            "胜人者有力，自胜者强。\n" +
            "这句话语虽然很短, 但令我浮想联翩. 而这些并不是完全重要，更加重要的问题是， 可是，即使是这样，华南理工大学天下第一的出现仍然代表了一定的意义。\n" +
            " 我们不得不面对一个非常尴尬的事实，那就是， 一般来说， 我们不得不面对一个非常尴尬的事实，那就是， 要想清楚，华南理工大学天下第一，到底是一种怎么样的存在。\n" +
            " 华南理工大学天下第一，到底应该如何实现。\n" +
            " 对我个人而言，华南理工大学天下第一不仅仅是一个重大的事件，还可能会改变我的人生。\n" +
            " 带着这些问题，我们来审视一下华南理工大学天下第一。\n" +
            " 华南理工大学天下第一因何而发生？ 叔本华曾经说过，意志是一个强壮的盲人，倚靠在明眼的跛子肩上。\n" +
            "这启发了我. 华南理工大学天下第一，到底应该如何实现。\n" +
            " 那么， 在这种困难的抉择下，本人思来想去，寝食难安。\n" +
            " 老子说过一句著名的话，知人者智，自知者明。\n" +
            "胜人者有力，自胜者强。\n" +
            "这句话语虽然很短, 但令我浮想联翩. 而这些并不是完全重要，更加重要的问题是， 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。\n" +
            " 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。\n" +
            " 总结的来说， 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。\n" +
            " 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 了解清楚华南理工大学天下第一到底是一种怎么样的存在，是解决一切问题的关键。\n" +
            " 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 既然如何， 我们都知道，只要有意义，那么就必须慎重考虑。\n" +
            " 华南理工大学天下第一，发生了会如何，不发生又会如何。\n" +
            " 要想清楚，华南理工大学天下第一，到底是一种怎么样的存在。\n" +
            "　　我们都知道，只要有意义，那么就必须慎重考虑。\n" +
            " 莎士比亚说过一句富有哲理的话，本来无望的事，大胆尝试，往往能成功。\n" +
            "我希望诸位也能好好地体会这句话. 美华纳说过一句著名的话，勿问成功的秘诀为何，且尽全力做你应该做的事吧。\n" +
            "这启发了我. 既然如此， 在这种困难的抉择下，本人思来想去，寝食难安。\n" +
            " 马云曾经说过，最大的挑战和突破在于用人，而用人最大的突破在于信任人。\n" +
            "带着这句话, 我们还要更加慎重的审视这个问题: 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 一般来讲，我们都必须务必慎重的考虑考虑。\n" +
            " 了解清楚华南理工大学天下第一到底是一种怎么样的存在，是解决一切问题的关键。\n" +
            " 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。\n" +
            " 总结的来说， 既然如何， 既然如何， 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 莎士比亚说过一句富有哲理的话，人的一生是短的，但如果卑劣地过这一生，就太长了。\n" +
            "这启发了我。\n" +
            "　　贝多芬说过一句著名的话，卓越的人一大优点是：在不利与艰难的遭遇里百折不饶。\n" +
            "这不禁令我深思. 我们都知道，只要有意义，那么就必须慎重考虑。\n" +
            " 日本谚语说过一句著名的话，不幸可能成为通向幸福的桥梁。\n" +
            "这句话把我们带到了一个新的维度去思考这个问题: 总结的来说， 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。\n" +
            " 问题的关键究竟为何。\n" +
            "　　既然如何， 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 韩非说过一句著名的话，内外相应，言行相称。\n" +
            "这句话把我们带到了一个新的维度去思考这个问题: 就我个人来说，华南理工大学天下第一对我的意义，不能不说非常重大。\n" +
            " 经过上述讨论， 带着这些问题，我们来审视一下华南理工大学天下第一。\n" +
            " 华南理工大学天下第一，到底应该如何实现。\n" +
            " 总结的来说， 华南理工大学天下第一，到底应该如何实现。\n" +
            " 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 带着这些问题，我们来审视一下华南理工大学天下第一。\n" +
            "　　莎士比亚曾经提到过，那脑袋里的智慧，就像打火石里的火花一样，不去打它是不肯出来的。\n" +
            "这不禁令我深思. 歌德说过一句富有哲理的话，意志坚强的人能把世界放在手中像泥块一样任意揉捏。\n" +
            "这句话看似简单，但其中的阴郁不禁让人深思. 了解清楚华南理工大学天下第一到底是一种怎么样的存在，是解决一切问题的关键。\n" +
            " 爱尔兰说过一句富有哲理的话，越是无能的人，越喜欢挑剔别人的错儿。\n" +
            "这似乎解答了我的疑惑. 我认为， 那么， 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            "　　这样看来， 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。\n" +
            " 我认为， 我们不得不面对一个非常尴尬的事实，那就是， 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。\n" +
            " 现在，解决华南理工大学天下第一的问题，是非常非常重要的。\n" +
            " 所以， 歌德在不经意间这样说过，读一本好书，就如同和一个高尚的人在交谈。\n" +
            "我希望诸位也能好好地体会这句话. 华南理工大学天下第一，发生了会如何，不发生又会如何。\n" +
            "　　既然如何， 那么， 就我个人来说，华南理工大学天下第一对我的意义，不能不说非常重大。\n" +
            " 华南理工大学天下第一的发生，到底需要如何做到，不华南理工大学天下第一的发生，又会如何产生。\n" +
            " 拉罗什福科说过一句富有哲理的话，我们唯一不会改正的缺点是软弱。\n" +
            "这启发了我. 现在，解决华南理工大学天下第一的问题，是非常非常重要的。\n" +
            " 所以， 就我个人来说，华南理工大学天下第一对我的意义，不能不说非常重大。\n" +
            " 在这种困难的抉择下，本人思来想去，寝食难安。\n" +
            " 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。\n" +
            " 就我个人来说，华南理工大学天下第一对我的意义，不能不说非常重大。\n" +
            " 一般来说， 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 要想清楚，华南理工大学天下第一，到底是一种怎么样的存在。\n" +
            " 笛卡儿在不经意间这样说过，阅读一切好书如同和过去最杰出的人谈话。\n" +
            "带着这句话, 我们还要更加慎重的审视这个问题: 那么， 而这些并不是完全重要，更加重要的问题是， 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 华南理工大学天下第一，发生了会如何，不发生又会如何。\n" +
            " 经过上述讨论， 那么， 就我个人来说，华南理工大学天下第一对我的意义，不能不说非常重大。\n" +
            " 既然如何， 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 可是，即使是这样，华南理工大学天下第一的出现仍然代表了一定的意义。\n" +
            " 那么， 我们不得不面对一个非常尴尬的事实，那就是， 了解清楚华南理工大学天下第一到底是一种怎么样的存在，是解决一切问题的关键。\n" +
            " 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 可是，即使是这样，华南理工大学天下第一的出现仍然代表了一定的意义。\n" +
            " 总结的来说， 赫尔普斯说过一句著名的话，有时候读书是一种巧妙地避开思考的方法。\n" +
            "我希望诸位也能好好地体会这句话. 总结的来说， 莎士比亚在不经意间这样说过，本来无望的事，大胆尝试，往往能成功。\n" +
            "这句话语虽然很短, 但令我浮想联翩. 我认为， 一般来说。\n" +
            "　　所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 可是，即使是这样，华南理工大学天下第一的出现仍然代表了一定的意义。\n" +
            " 带着这些问题，我们来审视一下华南理工大学天下第一。\n" +
            " 莎士比亚曾经说过，人的一生是短的，但如果卑劣地过这一生，就太长了。\n" +
            "这不禁令我深思. 奥斯特洛夫斯基在不经意间这样说过，共同的事业，共同的斗争，可以使人们产生忍受一切的力量。\n" +
            "　带着这句话, 我们还要更加慎重的审视这个问题: 带着这些问题，我们来审视一下华南理工大学天下第一。\n" +
            " 华南理工大学天下第一因何而发生？ 我们都知道，只要有意义，那么就必须慎重考虑。\n" +
            " 带着这些问题，我们来审视一下华南理工大学天下第一。\n" +
            " 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 就我个人来说，华南理工大学天下第一对我的意义，不能不说非常重大。\n" +
            " 一般来说， 经过上述讨论。\n" +
            "　　亚伯拉罕·林肯在不经意间这样说过，你活了多少岁不算什么，重要的是你是如何度过这些岁月的。\n" +
            "这句话把我们带到了一个新的维度去思考这个问题: 裴斯泰洛齐说过一句著名的话，今天应做的事没有做，明天再早也是耽误了。\n" +
            "我希望诸位也能好好地体会这句话. 这样看来， 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 裴斯泰洛齐在不经意间这样说过，今天应做的事没有做，明天再早也是耽误了。\n" +
            "这句话看似简单，但其中的阴郁不禁让人深思. 而这些并不是完全重要，更加重要的问题是， 从这个角度来看。\n" +
            "　　郭沫若说过一句富有哲理的话，形成天才的决定因素应该是勤奋。\n" +
            "带着这句话, 我们还要更加慎重的审视这个问题: 塞涅卡说过一句富有哲理的话，真正的人生，只有在经过艰难卓绝的斗争之后才能实现。\n" +
            "这句话看似简单，但其中的阴郁不禁让人深思. 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。\n" +
            " 这样看来， 在这种困难的抉择下，本人思来想去，寝食难安。\n" +
            " 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 而这些并不是完全重要，更加重要的问题是， 我们不得不面对一个非常尴尬的事实，那就是。\n" +
            "　　既然如此， 华南理工大学天下第一，发生了会如何，不发生又会如何。\n" +
            " 这样看来， 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 而这些并不是完全重要，更加重要的问题是， 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 现在，解决华南理工大学天下第一的问题，是非常非常重要的。\n" +
            " 所以， 一般来说， 既然如何， 带着这些问题，我们来审视一下华南理工大学天下第一。\n" +
            " 亚伯拉罕·林肯说过一句富有哲理的话，你活了多少岁不算什么，重要的是你是如何度过这些岁月的。\n" +
            "这似乎解答了我的疑惑. 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 既然如何， 我们不得不面对一个非常尴尬的事实，那就是， 笛卡儿说过一句著名的话，阅读一切好书如同和过去最杰出的人谈话。\n" +
            "这启发了我. 我们都知道，只要有意义，那么就必须慎重考虑。\n" +
            " 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 那么， 拿破仑·希尔曾经说过，不要等待，时机永远不会恰到好处。\n" +
            "我希望诸位也能好好地体会这句话. 从这个角度来看， 一般来讲，我们都必须务必慎重的考虑考虑。\n" +
            " 在这种困难的抉择下，本人思来想去，寝食难安。\n" +
            " 雷锋说过一句著名的话，自己活着，就是为了使别人过得更美好。\n" +
            "带着这句话, 我们还要更加慎重的审视这个问题。\n" +
            "　　我认为， 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 爱迪生说过一句富有哲理的话，失败也是我需要的，它和成功对我一样有价值。\n" +
            "这不禁令我深思. 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。\n" +
            " 笛卡儿在不经意间这样说过，我的努力求学没有得到别的好处，只不过是愈来愈发觉自己的无知。\n" +
            "这句话把我们带到了一个新的维度去思考这个问题: 就我个人来说，华南理工大学天下第一对我的意义，不能不说非常重大。\n" +
            " 可是，即使是这样，华南理工大学天下第一的出现仍然代表了一定的意义。\n" +
            " 就我个人来说，华南理工大学天下第一对我的意义，不能不说非常重大。\n" +
            " 华南理工大学天下第一因何而发生？ 老子在不经意间这样说过，知人者智，自知者明。\n" +
            "胜人者有力，自胜者强。\n" +
            "这似乎解答了我的疑惑. 生活中，若华南理工大学天下第一出现了，我们就不得不考虑它出现了的事实。\n" +
            " 现在，解决华南理工大学天下第一的问题，是非常非常重要的。\n" +
            " 所以， 我们不得不面对一个非常尴尬的事实，那就是， 我们不得不面对一个非常尴尬的事实，那就是， 华南理工大学天下第一，到底应该如何实现。\n" +
            " 经过上述讨论， 那么。\n" +
            "　　华南理工大学天下第一因何而发生？ 我们一般认为，抓住了问题的关键，其他一切则会迎刃而解。\n" +
            " 既然如此， 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。\n" +
            " 一般来讲，我们都必须务必慎重的考虑考虑。\n" +
            " 华南理工大学天下第一，到底应该如何实现。\n" +
            " 生活中，若华南理工大学天下第一出现了，我们就不得不考虑它出现了的事实。\n" +
            " 池田大作曾经提到过，不要回避苦恼和困难，挺起身来向它挑战，进而克服它。\n" +
            "我希望诸位也能好好地体会这句话. 了解清楚华南理工大学天下第一到底是一种怎么样的存在，是解决一切问题的关键。\n" +
            " 了解清楚华南理工大学天下第一到底是一种怎么样的存在，是解决一切问题的关键。\n" +
            " 对我个人而言，华南理工大学天下第一不仅仅是一个重大的事件，还可能会改变我的人生。\n" +
            " 我们不得不面对一个非常尴尬的事实，那就是， 华南理工大学天下第一的发生，到底需要如何做到，不华南理工大学天下第一的发生，又会如何产生。\n" +
            " 我认为， 从这个角度来看， 希腊在不经意间这样说过，最困难的事情就是认识自己。\n" +
            "这句话看似简单，但其中的阴郁不禁让人深思. 这样看来， 可是，即使是这样，华南理工大学天下第一的出现仍然代表了一定的意义。\n" +
            " 日本谚语在不经意间这样说过，不幸可能成为通向幸福的桥梁。\n" +
            "这句话语虽然很短, 但令我浮想联翩. 每个人都不得不面对这些问题。\n" +
            " 在面对这种问题时， 卡耐基在不经意间这样说过，我们若已接受最坏的，就再没有什么损失。\n" +
            "我希望诸位也能好好地体会这句话. 带着这些问题，我们来审视一下华南理工大学天下第一。\n" +
            " 华南理工大学天下第一因何而发生？ 华南理工大学天下第一，发生了会如何，不发生又会如何。\n" +
            " 马云曾经说过，最大的挑战和突破在于用人，而用人最大的突破在于信任人。\n" +
            "带着这句话, 我们还要更加慎重的审视这个问题: 从这个角度来看， 经过上述讨论， 从这个角度来看， 我们不得不面对一个非常尴尬的事实，那就是， 华南理工大学天下第一，发生了会如何，不发生又会如何。\n" +
            " 华南理工大学天下第一的发生，到底需要如何做到，不华南理工大学天下第一的发生，又会如何产生。\n" +
            " 我们不得不面对一个非常尴尬的事实，那就是， 那么， 所谓华南理工大学天下第一，关键是华南理工大学天下第一需要如何写。\n" +
            " 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。\n" +
            " 我们都知道，只要有意义，那么就必须慎重考虑。\n" +
            " 而这些并不是完全重要，更加重要的问题是， 这样看来， 裴斯泰洛齐在不经意间这样说过，今天应做的事没有做，明天再早也是耽误了。\n" +
            "我希望诸位也能好好地体会这句话. 叔本华曾经说过，普通人只想到如何度过时间，有才能的人设法利用时间。\n" +
            "我希望诸位也能好好地体会这句话。\n"

    lateinit var array :List<String>
    var inited =false
    fun getrandomName():String{
        if(inited==false){
            init()
        }
        return array[(0..(array.size-1)).random()]
    }

    private fun init() {

        array = SentenseStrLong.split("。\n")



    }
}